In [1]:
import pandas as pd

Q1

1-To create a data frame from given data Dataframe function is used.

In [11]:
data={'Name':['Alice','Bob','Claine'],'Age':[25,30,37],'Gender':['Female','Male','Female']}
df=pd.DataFrame(data)

2-To create a series frame from given data Series function is used.

In [ ]:
data=[4,8,15,16,23,42]
ser=pd.Series(data)

3-To read a csv file in python read_csv function is used.

In [ ]:
df1=pd.read_csv('file.csv')

4-To know the columns present in the data frame columns function is used

In [6]:
df.columns

Index(['Name', 'Age', 'Gender'], dtype='object')

5-To know the data types of the column present in data frame

In [7]:
df.dtypes

Name      object
Age        int64
Gender    object
dtype: object

Q2

In [10]:
data={'A':[1,2,3],'B':[4,5,6],'C':[7,8,9]}
df2=pd.DataFrame(data)

In [12]:
df2

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

Q3

In [50]:
data={'Values':[25,30,37,87,54,98,75]}
df3=pd.DataFrame(data)

In [51]:
df3

   Values
0      25
1      30
2      37
3      87
4      54
5      98
6      75

In [60]:
df3=df3.head(3)
df3['Values'].apply(sum(x))

NameError: name 'x' is not defined

In [47]:
def test():
    sum=0
    for i in df3['Values'][0:3]:
            sum+=i
    print(sum)
test()

92

Q4

In [48]:
data={'text':["When you have a dream, you've got to grab it and never let go.","There is nothing impossible to they who will try."]}
df3=pd.DataFrame(data)

In [49]:
df3

                                                text
0  When you have a dream, you've got to grab it a...
1  There is nothing impossible to they who will try.

In [53]:
df3['Word-count']=df3['text'].apply(lambda x:len(x.split()))

In [54]:
df3

                                                text  Word-count
0  When you have a dream, you've got to grab it a...          14
1  There is nothing impossible to they who will try.           9

Q5

Size:Returns size of dataframe/series which is equivalent to total number of elements. That is rows x columns.

Shape:Returns tuple of shape (Rows, columns) of dataframe/series

Q6

pd.read_excel function is used to read the excel file in pandas

Q7

In [74]:
data={'email':['harsh@gmail.com','yash@gmail.com','akarsh@gmail.com','vishal@gmail.com']}
df4=pd.DataFrame(data)

In [75]:
df4

              email
0   harsh@gmail.com
1    yash@gmail.com
2  akarsh@gmail.com
3  vishal@gmail.com

In [76]:
df4['username']=df4['email'].apply(lambda x:x.split('@')[0])

In [77]:
df4

              email username
0   harsh@gmail.com    harsh
1    yash@gmail.com     yash
2  akarsh@gmail.com   akarsh
3  vishal@gmail.com   vishal

Q8

In [13]:
data={'A':[3,8,6,2,9],'B':[5,2,9,3,1],'C':[1,7,4,5,2]}
df4=pd.DataFrame(data)

In [86]:
df5=df4[df4['A'].apply(lambda x:x>5) & df4['B'].apply(lambda x:x<10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9

In [18]:
data={'Values':[25,30,37,87,54,98,75]}
df6=pd.DataFrame(data)

In [15]:
df6['Values'].mean()

58.0

In [91]:
df6['Values'].median()

54.0

In [19]:
df6['Values'].std()

29.040202019499336

Q10

In [14]:
data={'sales':[600,550,800,2000,2500,1500,5600],'date':l}
df=pd.DataFrame(data)

In [9]:
pd.date_range(start='2023-02-21',end='2023-02-27')

DatetimeIndex(['2023-02-20', '2023-02-21', '2023-02-22', '2023-02-23',
               '2023-02-24', '2023-02-25', '2023-02-26', '2023-02-27'],
              dtype='datetime64[ns]', freq='D')

In [12]:
l=list(pd.date_range(start='2023-02-21',end='2023-02-27'))

In [13]:
l

[Timestamp('2023-02-21 00:00:00', freq='D'),
 Timestamp('2023-02-22 00:00:00', freq='D'),
 Timestamp('2023-02-23 00:00:00', freq='D'),
 Timestamp('2023-02-24 00:00:00', freq='D'),
 Timestamp('2023-02-25 00:00:00', freq='D'),
 Timestamp('2023-02-26 00:00:00', freq='D'),
 Timestamp('2023-02-27 00:00:00', freq='D')]

In [15]:
df

   sales       date
0    600 2023-02-21
1    550 2023-02-22
2    800 2023-02-23
3   2000 2023-02-24
4   2500 2023-02-25
5   1500 2023-02-26
6   5600 2023-02-27

In [17]:
df['moving-average']=df['sales'].rolling(window=7).mean()

In [18]:
df

   sales       date  moving-average
0    600 2023-02-21             NaN
1    550 2023-02-22             NaN
2    800 2023-02-23             NaN
3   2000 2023-02-24             NaN
4   2500 2023-02-25             NaN
5   1500 2023-02-26             NaN
6   5600 2023-02-27     1935.714286

Q11

In [20]:
l=list(pd.date_range(start='2023-01-01',end='2023-01-05'))
l

[Timestamp('2023-01-01 00:00:00', freq='D'),
 Timestamp('2023-01-02 00:00:00', freq='D'),
 Timestamp('2023-01-03 00:00:00', freq='D'),
 Timestamp('2023-01-04 00:00:00', freq='D'),
 Timestamp('2023-01-05 00:00:00', freq='D')]

In [23]:
data={'date':l}
df=pd.DataFrame(data)

In [24]:
df

        date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [27]:
def test(x):
    l=['Monday','Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday','Sunday']
    return l[x]

df['weekday']=df['date'].dt.weekday.apply(lambda x: test(x))

In [28]:
df

        date    weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q12

In [35]:
l=list(pd.date_range(start='2023-01-01',end='2023-02-28'))

In [31]:
l

[Timestamp('2023-01-01 00:00:00', freq='D'),
 Timestamp('2023-01-02 00:00:00', freq='D'),
 Timestamp('2023-01-03 00:00:00', freq='D'),
 Timestamp('2023-01-04 00:00:00', freq='D'),
 Timestamp('2023-01-05 00:00:00', freq='D'),
 Timestamp('2023-01-06 00:00:00', freq='D'),
 Timestamp('2023-01-07 00:00:00', freq='D'),
 Timestamp('2023-01-08 00:00:00', freq='D'),
 Timestamp('2023-01-09 00:00:00', freq='D'),
 Timestamp('2023-01-10 00:00:00', freq='D'),
 Timestamp('2023-01-11 00:00:00', freq='D'),
 Timestamp('2023-01-12 00:00:00', freq='D'),
 Timestamp('2023-01-13 00:00:00', freq='D'),
 Timestamp('2023-01-14 00:00:00', freq='D'),
 Timestamp('2023-01-15 00:00:00', freq='D'),
 Timestamp('2023-01-16 00:00:00', freq='D'),
 Timestamp('2023-01-17 00:00:00', freq='D'),
 Timestamp('2023-01-18 00:00:00', freq='D'),
 Timestamp('2023-01-19 00:00:00', freq='D'),
 Timestamp('2023-01-20 00:00:00', freq='D'),
 Timestamp('2023-01-21 00:00:00', freq='D'),
 Timestamp('2023-01-22 00:00:00', freq='D'),
 Timestamp('2023-01-23 00:00:00', freq='D'),
 Timestamp('2023-01-24 00:00:00', freq='D'),
 Timestamp('2023-01-25 00:00:00', freq='D'),
 Timestamp('2023-01-26 00:00:00', freq='D'),
 Timestamp('2023-01-27 00:00:00', freq='D'),
 Timestamp('2023-01-28 00:00:00', freq='D'),
 Timestamp('2023-01-29 00:00:00', freq='D'),
 Timestamp('2023-01-30 00:00:00', freq='D'),
 Timestamp('2023-01-31 00:00:00', freq='D'),
 Timestamp('2023-02-01 00:00:00', freq='D'),
 Timestamp('2023-02-02 00:00:00', freq='D'),
 Timestamp('2023-02-03 00:00:00', freq='D'),
 Timestamp('2023-02-04 00:00:00', freq='D'),
 Timestamp('2023-02-05 00:00:00', freq='D'),
 Timestamp('2023-02-06 00:00:00', freq='D'),
 Timestamp('2023-02-07 00:00:00', freq='D'),
 Timestamp('2023-02-08 00:00:00', freq='D'),
 Timestamp('2023-02-09 00:00:00', freq='D'),
 Timestamp('2023-02-10 00:00:00', freq='D'),
 Timestamp('2023-02-11 00:00:00', freq='D'),
 Timestamp('2023-02-12 00:00:00', freq='D'),
 Timestamp('2023-02-13 00:00:00', freq='D'),
 Timestamp('2023-02-14 00:00:00', freq='D'),
 Timestamp('2023-02-15 00:00:00', freq='D'),
 Timestamp('2023-02-16 00:00:00', freq='D'),
 Timestamp('2023-02-17 00:00:00', freq='D'),
 Timestamp('2023-02-18 00:00:00', freq='D'),
 Timestamp('2023-02-19 00:00:00', freq='D'),
 Timestamp('2023-02-20 00:00:00', freq='D'),
 Timestamp('2023-02-21 00:00:00', freq='D'),
 Timestamp('2023-02-22 00:00:00', freq='D'),
 Timestamp('2023-02-23 00:00:00', freq='D'),
 Timestamp('2023-02-24 00:00:00', freq='D'),
 Timestamp('2023-02-25 00:00:00', freq='D'),
 Timestamp('2023-02-26 00:00:00', freq='D'),
 Timestamp('2023-02-27 00:00:00', freq='D'),
 Timestamp('2023-02-28 00:00:00', freq='D')]

In [32]:
data={'date':l}
df=pd.DataFrame(data)

In [33]:
df

         date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31
31 2023-02-01
32 2023-02-02
33 2023-02-03
34 2023-02-04
35 2023-02-05
36 2023-02-06
37 2023-02-07
38 2023-02-08
39 2023-02-09
40 2023-02-10
41 2023-02-11
42 2023-02-12
43 2023-02-13
44 2023-02-14
45 2023-02-15
46 2023-02-16
47 2023-02-17
48 2023-02-18
49 2023-02-19
50 2023-02-20
51 2023-02-21
52 2023-02-22
53 2023-02-23
54 2023-02-24
55 2023-02-25
56 2023-02-26
57 2023-02-27
58 2023-02-28

In [34]:
df.dtypes

date    datetime64[ns]
dtype: object

In [ ]:
df.set_index('date',inplace=True)

In [45]:
df=df.loc['2023-01-01':'2023-01-31']

In [48]:
df.reset_index()

         date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31

Q13

To use the basic function of pandas pandas library is to be imorted first.